app/controllers/api/v1/comments_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
      @story = Story.find(params[:id])