app/controllers/comments_controller.rb

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "story_id") VALUES ($1, $2) RETURNING "id"  [["content", "whatever"], ["story_id", 24]]
---
  def create
    @story = Story.find(params[:id])
    @comment = Comment.new(comment_params)
    @story.comments << @comment

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def index
    @story = Story.find(params[:id])