app/controllers/stories_controller.rb

INSERT INTO "stories" ("name", "title", "location", "content", "likes") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Jack the Ripper"], ["title", "What a Crazy Night"], ["location", "London, UK"], ["content", "Probably shouldn't talk about this..."], ["likes", 0]]
---
  def create
    @story = Story.new(story_params)
    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stories" SET "likes" = $1 WHERE "stories"."id" = $2  [["likes", 1], ["id", 1]]
---
  def update
    @story = Story.find(params[:id])
    @story.likes += 1
    @story.save